wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 201805102.c
/**************************************************************************************************
* 液晶屏驱动IC
* 文件<$(filename)>
* 模块描述 :	定义、功能、说明
* 历史修改记录
*     <主要修改者>  <时间>   <版本 >   <说明>
*     xlyan        $(Date)   1.0.0    创建文件
**************************************************************************************************/
#include "R61509V.h"

#include "STM32_GPIO.H"
#include "STM32_PWM.H"
#include "STM32_SYSTICK.H"
#include "font.h"


#define	Screen_Rotate	90
//#ifdef R61509V_61509_EN

t_R61509VCfg g_R61509VCfg;

u16 Sreen_Rotate=SCREEN_ROTATE_270D;			//屏方向

R61509VPortDef *R61509VPort	=	0;					//宏定义使用变量

u16 R61509V_BACK_COLOR	=	R61509V_WHITE;		//背景色
u16 R61509V_POINT_COLOR	=	R61509V_BLACK;   	//画笔色


/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void R61509V_Initialize(R61509VDef *pInfo)
{
//	R61509V_sPinfo=pInfo;
	R61509VPort	=	&(pInfo->Port);		//宏定义使用变量
	
	R61509V_PinConf(pInfo);
	R61509V_PowerOn();								//按照主控芯片R61509V的power supply on sequence 进行配置
	
	R61509V_BL_ON;		//开背光
	

	
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void R61509V_Delay(u32 xms)
{
	while(xms--);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void R61509V_PinConf(R61509VDef *pInfo)
{
	R61509VPortDef		*Port;	
	
	Port	=	&(pInfo->Port);
	
	GPIO_Configuration_OPP50	(Port->sBL_PORT,				Port->sBL_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sRD_PORT,				Port->sRD_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sREST_PORT,			Port->sREST_Pin);				//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sRS_PORT,				Port->sRS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sWR_PORT,				Port->sWR_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sCS_PORT,				Port->sCS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sTE_PORT,				Port->sTE_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sDATABUS_PORT,		Port->sDATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605	
	
	
	R61509V_RD_HIGH;	//读信号;0:读数据
}


#if 1
/*******************************************************************************
* 函数名			:	R61509V_WriteIndex16
* 功能描述		:	写16位索引
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteIndex16(unsigned short Index)	//写16位命令索引编号
{
	R61509V_CS_LOW; //片选信号 0:片选;1:失能;
	R61509V_RS_LOW; //命令/数据：0：命令;1-数据		
	R61509V_DATABUS_PORT->ODR = Index;
	R61509V_WR_LOW;	//写信号 在WR的上升沿，使数据写入到R61509V里面	
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	R61509V_WriteData16
* 功能描述		:	写16位数据
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteData16(unsigned short Data)			//写16位数据
{
	R61509V_CS_LOW; 	//片选信号 0:片选;1:失能;
	R61509V_RS_HIGH; 	//命令/数据：0：命令;1-数据		
//	R61509V_RD_HIGH;	//读信号;0:读数据
	R61509V_DATABUS_PORT->ODR = Data;
	R61509V_WR_LOW;		//写信号 在WR的上升沿，使数据写入到R61509V里面
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}



#else
/*******************************************************************************
* 函数名			:	R61509V_WriteData16
* 功能描述		:	写8位数据
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteData16(unsigned short dashuju)			//写16位数据
{
	//****写入高位
	R61509V_CS_LOW; 	//片选信号 0:片选;1:失能;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH; 	//命令/数据：0：命令;1-数据
	R61509V_WR_LOW;		//写信号 在WR的上升沿，使数据写入到R61509V里面
	DATA=dashuju>>8;
	R61509V_WR_HIGH;
//****写入低位
	R61509V_WR_LOW;
	DATA=dashuju;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	R61509V_WriteIndex16
* 功能描述		:	写8位索引
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_WriteIndex16(unsigned short damingling)		//写16位命令索引编号
{
	//****写入高位
	R61509V_CS_LOW; //片选打开
	R61509V_RS_LOW; //命令/数据：0：命令;1-数据
	R61509V_WR_LOW;
	DATA=damingling>>8;
	R61509V_WR_HIGH;
	//****写入低位
	R61509V_WR_LOW;
	DATA=damingling;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}
#endif
/**************************************************************************************************
* [Function] R61509V_ReadData:  从R61509V读取数据
* [No param][return]u16: 返回数据
**************************************************************************************************/
u16 R61509V_ReadData( void )
{
	u16 Dat;

	R61509V_CS_LOW;
	R61509V_WR_HIGH;
	R61509V_RS_HIGH;
	Dat = R61509V_DATABUS_PORT->IDR;
	R61509V_RD_LOW;
	R61509V_RD_HIGH;
	R61509V_CS_HIGH;

	return(Dat);
}

/*******************************************************************************
*函数名			:	R61509V_WriteCommand
*功能描述		:	写完整控制命令
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_WriteCommand(												//写完整控制命令
											unsigned short index,			//寄存器索引
											unsigned short Command		//命令
											)	//写完整控制命令
{
	R61509V_WriteIndex16(index);		//写16位命令索引编号+
//	R61509V_Delay(100);							//
	R61509V_WriteData16(Command);
//	R61509V_Delay(100);
}

