wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 201805102.c
/*******************************************************************************
*函数名			:	R61509V_SetWindowAddress
*功能描述		:	设置窗口地址
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_SetWindowAddress(			//设置窗口地址
															unsigned short x1,		//水平起始点
															unsigned short y1,		//水平终止点
															unsigned short x2,		//垂直起始点
															unsigned short y2			//垂直终止点
															)
{
#if	(Screen_Rotate	==0)
	//	R61509V_W	400
	//	R61509V_H 240
	R61509V_WriteCommand(R61509V_R210_HSA,x1);		//Window Horizontal RAM Address Start(R210h)		//水平
	R61509V_WriteCommand(R61509V_R211_HEA,x2);		//Window Horizontal RAM Address End(R211h)			//水平
	R61509V_WriteCommand(R61509V_R212_VSA,y1);		//Window Vertical RAM Address Start (R212h)			//垂直
	R61509V_WriteCommand(R61509V_R213_VEA,y2);		//Window Vertical RAM Address End (R213h)				//垂直
	
	R61509V_WriteCommand(R61509V_R200_HA,x1);			//RAM Address Set (Horizontal Address) (R200h)
	R61509V_WriteCommand(R61509V_R201_VA,y1);			//RAM Address Set (Vertical Address) (R201h)
	R61509V_WriteCommand(R61509V_R003_EM,0X5030);	//RAM Address Set (Vertical Address) (R201h)
	R61509V_WriteIndex16(R61509V_R202_GDRW);			//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
#elif (Screen_Rotate	==90)
	//	R61509V_W	400
	//	R61509V_H 240
	R61509V_WriteCommand(R61509V_R210_HSA,y1);							//Window Horizontal RAM Address Start(R210h)		//水平
	R61509V_WriteCommand(R61509V_R211_HEA,y2);							//Window Horizontal RAM Address End(R211h)			//水平
	R61509V_WriteCommand(R61509V_R212_VSA,R61509V_V-x2-1);	//Window Vertical RAM Address Start (R212h)			//垂直
	R61509V_WriteCommand(R61509V_R213_VEA,R61509V_V-x1-1);	//Window Vertical RAM Address End (R213h)				//垂直
	
	R61509V_WriteCommand(R61509V_R200_HA,y1);								//RAM Address Set (Horizontal Address) (R200h)
	R61509V_WriteCommand(R61509V_R201_VA,R61509V_V-x2-1);		//RAM Address Set (Vertical Address) (R201h)	
	R61509V_WriteCommand(R61509V_R003_EM,0X5018);						//RAM Address Set (Vertical Address) (R201h)
	R61509V_WriteIndex16(R61509V_R202_GDRW);								//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
#elif (Screen_Rotate	==180)
	//	R61509V_W	400
	//	R61509V_H 240
	R61509V_WriteCommand(R61509V_R210_HSA,R61509V_H-x2-1);							//Window Horizontal RAM Address Start(R210h)		//水平
	R61509V_WriteCommand(R61509V_R211_HEA,R61509V_H-x1-1);							//Window Horizontal RAM Address End(R211h)			//水平
	R61509V_WriteCommand(R61509V_R212_VSA,R61509V_V-y2-1);	//Window Vertical RAM Address Start (R212h)			//垂直
	R61509V_WriteCommand(R61509V_R213_VEA,R61509V_V-y1-1);	//Window Vertical RAM Address End (R213h)				//垂直
	
	R61509V_WriteCommand(R61509V_R200_HA,R61509V_H-x2-1);								//RAM Address Set (Horizontal Address) (R200h)
	R61509V_WriteCommand(R61509V_R201_VA,R61509V_V-y2-1);		//RAM Address Set (Vertical Address) (R201h)
	
	R61509V_WriteCommand(R61509V_R003_EM,0X5000);						//RAM Address Set (Vertical Address) (R201h)
	R61509V_WriteIndex16(R61509V_R202_GDRW);								//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
#elif (Screen_Rotate	==270)
	//	R61509V_W	400
	//	R61509V_H 240
	R61509V_WriteCommand(R61509V_R210_HSA,R61509V_H-y2-1);							//Window Horizontal RAM Address Start(R210h)		//水平
	R61509V_WriteCommand(R61509V_R211_HEA,R61509V_H-y1-1);							//Window Horizontal RAM Address End(R211h)			//水平
	R61509V_WriteCommand(R61509V_R212_VSA,x1);	//Window Vertical RAM Address Start (R212h)			//垂直
	R61509V_WriteCommand(R61509V_R213_VEA,x2);	//Window Vertical RAM Address End (R213h)				//垂直
	
	R61509V_WriteCommand(R61509V_R200_HA,R61509V_H-y2-1);								//RAM Address Set (Horizontal Address) (R200h)
	R61509V_WriteCommand(R61509V_R201_VA,x1);		//RAM Address Set (Vertical Address) (R201h)
	
	R61509V_WriteCommand(R61509V_R003_EM,0X5028);						//RAM Address Set (Vertical Address) (R201h)
	R61509V_WriteIndex16(R61509V_R202_GDRW);								//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
#endif
}


/*******************************************************************************
*函数名			:	R61509V_Initialize
*功能描述		:	IC初始化：按照主控芯片R61509V的power supply on sequence 进行配置
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_PowerOn(void)			//按照主控芯片R61509V的power supply on sequence 进行配置
{
	u32 dtime=2000;
	
	R61509V_CS_LOW;
	R61509V_WR_HIGH;
	R61509V_RD_HIGH;
	R61509V_RST_HIGH;
	R61509V_Delay(dtime);
	R61509V_RST_LOW;
	R61509V_Delay(dtime);
	R61509V_RST_HIGH;	
	R61509V_Delay(dtime);		//复位后1ms内部晶振启动
	dtime=500;
	
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	R61509V_WriteCommand(R61509V_R000_IR		,	0x0000);		R61509V_Delay(dtime); //四次写0x00
	
	R61509V_WriteCommand(R61509V_R001_DOC		,	0x0300);		R61509V_Delay(dtime); //--------显示方向控制When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
	R61509V_WriteCommand(R61509V_R002_DWC		,	0x0100);		R61509V_Delay(dtime); //--------	
	R61509V_WriteCommand(R61509V_R003_EM		,	0X5030);		R61509V_Delay(dtime); //--------RGB设为5-6-5模式------------0X5030
	R61509V_WriteCommand(R61509V_R007_DC1		,	0x0100);		R61509V_Delay(dtime); //--------测试显示控制base image的关与开
	R61509V_WriteCommand(R61509V_R008_DC2		,	0X0808);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R009_DC3		,	0x0001);		R61509V_Delay(dtime); //--------	
	
	R61509V_WriteCommand(R61509V_R00B_ECC		,	0x0001);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R00C_EDIC1	,	0x0000);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R00F_EDIC2	,	0x0000);		R61509V_Delay(dtime); //--------
	
	R61509V_WriteCommand(R61509V_R010_PIC1	,	0x0019);		R61509V_Delay(dtime); //--------面板频率--0x19
	R61509V_WriteCommand(R61509V_R011_PIC2	,	0x0101);		R61509V_Delay(dtime); //--------		Panel Interface Control 2 (R011h)
	R61509V_WriteCommand(R61509V_R012_PIC3	,	0x0000);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R013_PIC4	,	0x0001);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R014_PIC5	,	0x0055);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R020_PIC6	,	0x0010);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R021_PIC7	,	0x0101);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R022_PIC8	,	0x0000);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R023_PIC9	,	0x0001);		R61509V_Delay(dtime); //--------	
	
	R61509V_WriteCommand(R61509V_R090_FMC		,	0x8000);		R61509V_Delay(dtime); //--------窗特征控制，FMARK interface
	
