wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 201805102.c
	R61509V_WriteCommand(R61509V_R100_PC1		,	0x0330);		R61509V_Delay(dtime); //--------设置电源控制，平衡显示与电消耗
	R61509V_WriteCommand(R61509V_R101_PC2		,	0x0227);		R61509V_Delay(dtime); //--------Power Control 2
	R61509V_WriteCommand(R61509V_R102_PC3		,	0xC1B0);		R61509V_Delay(dtime); //--------PSON,PON 都设为1，电源供应打开
	R61509V_WriteCommand(R61509V_R103_PC4		,	0x0D00);		R61509V_Delay(dtime); //--------	
	
	R61509V_WriteCommand(R61509V_R200_HA		,	0x0000);		R61509V_Delay(dtime);	//--------RAM address 设置
	R61509V_WriteCommand(R61509V_R201_VA		,	0x0000);		R61509V_Delay(dtime);	//--------
	
	R61509V_WriteCommand(R61509V_R280_NVM		,	0xB000);		R61509V_Delay(dtime);	//--------VCM
	
	R61509V_WriteCommand(R61509V_R300_YC1		,	0x0C00);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R301_YC2		,	0x5A0B);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R302_YC3		,	0x0906);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R303_YC4		,	0x1017);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R304_YC5		,	0x2300);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R305_YC6		,	0x1700);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R306_YC7		,	0x6309);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R307_YC8		,	0x0C09);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R308_YC9		,	0x100C);		R61509V_Delay(dtime); //--------
	R61509V_WriteCommand(R61509V_R309_YC10	,	0x2232);		R61509V_Delay(dtime); //--------
	
	R61509V_WriteCommand(R61509V_R400_BINL	,	0X6400);		R61509V_Delay(dtime); //base image 设置 400线
	R61509V_WriteCommand(R61509V_R401_BIDC	,	0x0004);		R61509V_Delay(dtime); //--------设置base image 滚动模式，开启滚动(颜色反相设置）
	R61509V_WriteCommand(R61509V_R404_BIVSC	,	0x0000);		R61509V_Delay(dtime);	//--------从0线开始滚屏
	
	R61509V_WriteCommand(R61509V_R502_PTEA	,	0x005f);		R61509V_Delay(dtime);
}

/**************************************************************************************************
* [Function] R61509V_PowerOff:  关闭R61509V 电源
* [No param]
**************************************************************************************************/
void R61509V_PowerOff( void )
{
	R61509V_WriteCommand( R61509V_R009_DC3, 0 );
	R61509V_Delay( 1 );
	R61509V_BL_OFF;
}
/**************************************************************************************************
* [Function] R61509V_DispOff:  关闭R61509V显示( 黑屏?)
* [No param]
**************************************************************************************************/
void R61509V_DispOff( void )
{
	R61509V_WriteCommand( R61509V_R007_DC1, 0x0000 );
}

/*******************************************************************************
*函数名			:	R61509V_Clean
*功能描述		:	清屏程序：清除屏幕函数---用背景色填充屏幕
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_Clean(u16 COLOR)	//清除屏幕函数
{
	//	R61509V_H 240		//水平方向点数，从左到右+
	//	R61509V_V 400		//垂直方向点数，从上到下+
	unsigned char i;
	unsigned int j;
	unsigned int Num;
#if	(Screen_Rotate	==0)
	R61509V_SetWindowAddress(0x00,0x00,R61509V_H-1,R61509V_V-1);
#elif (Screen_Rotate	==90)
	R61509V_SetWindowAddress(0x00,0x00,R61509V_V-1,R61509V_H-1);
#elif (Screen_Rotate	==180)
	R61509V_SetWindowAddress(0x00,0x00,R61509V_H-1,R61509V_V-1);
#elif (Screen_Rotate	==270)
	R61509V_SetWindowAddress(0x00,0x00,R61509V_V-1,R61509V_H-1);
#endif
	
	R61509V_CS_LOW; 	//片选打开
	R61509V_RS_HIGH; 	//数据	
	Num	=	R61509V_V*R61509V_H;
	for(j=1;j<=Num;j++)
	{
		R61509V_WR_LOW;
		R61509V_DATABUS_PORT->ODR = COLOR;		
		R61509V_WR_HIGH;
	}
	R61509V_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	CoordinateTransform
* 功能描述		:	坐标转换 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void CoordinateTransformb(
													unsigned short *x1,		//水平起始点
													unsigned short *y1,		//垂直起始点
													unsigned short *x2,		//水平终止点
													unsigned short *y2		//垂直终止点
													)
{
	//	R61509V_V	400
	//	R61509V_H 240
	
	
#if	(Screen_Rotate	==0)
	if(*x1	>=	R61509V_H)
	{
		*x1	=	R61509V_H	-	1;
	}
	if(*x2	>=	R61509V_H)
	{
		*x2	=	R61509V_H	-	1;
	}
	if(*y1	>=	R61509V_V)
	{
		*y1	=	R61509V_V	-	1;
	}
	if(*y2	>=	R61509V_V)
	{
		*y2	=	R61509V_V	-	1;
	}
#elif	(Screen_Rotate	==90)
	unsigned short H1	=	*x1;
	unsigned short V1	=	*y1;
	unsigned short H2	=	*x2;
	unsigned short V2	=	*y2;
	
	if(H1	>=	R61509V_V)
	{
		H1	=	R61509V_V	-	1;
	}
	if(H2	>=	R61509V_V)
	{
		H2	=	R61509V_V	-	1;
	}
	if(V1	>=	R61509V_H)
	{
		V1	=	R61509V_H	-	1;
	}
	if(V2	>=	R61509V_H)
	{
		V2	=	R61509V_H	-	1;
	}
	
	*x1	=	V1;
	*y1	=	R61509V_V	-	H2;
	*x2	=	V2;
	*y2	=	R61509V_V	-	H1;
	
#elif	(Screen_Rotate	==180)

#endif
	
}
/*******************************************************************************
*函数名			:	R61509V_DrawPoint
*功能描述		:	画点
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_DrawDot(u16 x,u16 y,u16 color)
{
//	R61509V_W 400
//	R61509V_H 240
//	u16 x1=0,y1=0;
//	switch(Sreen_Rotate)
//	{
//		case SCREEN_ROTATE_0D:{}
//			break;
//		case SCREEN_ROTATE_90D:{x1=R61509V_H-y;y=x;x=x1;}
//			break;
//		case SCREEN_ROTATE_180D:{x1=R61509V_H-x;y=R61509V_W-y;x=x1;}
//			break;
//		case	SCREEN_ROTATE_270D:{x1=y;y=R61509V_W-x;x=x1;}
//			break;
//		default: break;			
//	}

	R61509V_SetWindowAddress(x,y,x,y);	//设置光标位置 
	R61509V_WriteData16(color); 	//笔画颜色	    
}

/*******************************************************************************
*函数名		:	R61509V_DrawLine
*功能描述	:	画线
*输入			: x1,y1:起点坐标
						x2,y2:终点坐标
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void R61509V_DrawLine(
									u16 x1, u16 y1, 	//x1,y1:起点坐标
									u16 x2, u16 y2,		//x2,y2:终点坐标
									u16 color					//颜色
)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 

	delta_x=x2-x1; //计算坐标增量 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1;
	
