wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 201805102.c
	if(delta_x>0)
		incx=1; //设置单步方向 
	else if(delta_x==0)
		incx=0;//垂直线 
	else
		{
			incx=-1;
			delta_x=-delta_x;
		}
		
	if(delta_y>0)
		incy=1; 
	else if(delta_y==0)
		incy=0;//水平线 
	else
		{incy=-1;delta_y=-delta_y;} 
		
	if( delta_x>delta_y)
		distance=delta_x; 								//选取基本增量坐标轴 
	else
		distance=delta_y;
	
	for(t=0;t<distance+1;t++ )					//画线输出 
	{  
		R61509V_DrawDot(uRow,uCol,color);	//画点 
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}

//	u16	Num	=	0,i=0;
////	CoordinateTransform(&x1,&y1,&x2,&y2);
//	if(x1>x2)
//	{
//		Num	+=	x1-x2;
//	}
//	else
//	{
//		Num	+=	x2-x1;
//	}
//	if(y1>y2)
//	{
//		Num	+=	y1-y2;
//	}
//	else
//	{
//		Num	+=	y2-y1;
//	}
//	
//	R61509V_SetWindowAddress(x1,y1,x2,y2);//设置窗地址
//	for(i=0;i<Num;i++)
//	{
//		R61509V_WriteData16(color); 	//笔画颜色
//	}
}
/**************************************************************************************************
* [Function] R61509V_DrawCircle:  函数功能、注意事项等的描述
* [param01]t_Point point: description
* [param02]u16 R: description
* [param03]uint8_t Filled: description
* [param04]u16 color: description
**************************************************************************************************/
void R61509V_DrawCircle(
												u16 x,u16 y,		//圆心坐标原点
												u16 r,					//半径
												u8 Filled,			//是否填充
												u16 color				//颜色
												)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             //判断下个点位置的标志
	while(a<=b)
	{
		if(Filled)	//填充就画线
		{
			R61509V_DrawLine(x,y,x-b,y-a,color);             //3           
			R61509V_DrawLine(x,y,x+b,y-a,color);             //0           
			R61509V_DrawLine(x,y,x-a,y+b,color);             //1       
			R61509V_DrawLine(x,y,x-b,y-a,color);             //7           
			R61509V_DrawLine(x,y,x-a,y-b,color);             //2             
			R61509V_DrawLine(x,y,x+b,y+a,color);             //4               
			R61509V_DrawLine(x,y,x+a,y-b,color);             //5
			R61509V_DrawLine(x,y,x+a,y+b,color);             //6 
			R61509V_DrawLine(x,y,x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
			R61509V_DrawLine(x,y,x+a,y+b,color);				//AB 两个坐标画一条直线
		}
		else
		{
			R61509V_DrawDot(x-b,y-a,color);             //3           
			R61509V_DrawDot(x+b,y-a,color);             //0           
			R61509V_DrawDot(x-a,y+b,color);             //1       
			R61509V_DrawDot(x-b,y-a,color);             //7           
			R61509V_DrawDot(x-a,y-b,color);             //2             
			R61509V_DrawDot(x+b,y+a,color);             //4               
			R61509V_DrawDot(x+a,y-b,color);             //5
			R61509V_DrawDot(x+a,y+b,color);             //6 
			R61509V_DrawDot(x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
				R61509V_DrawDot(x+a,y+b,color);
		}
	}
}
/**************************************************************************************************
* [Function] R61509V_DrawRectangle:  画一下矩形框
* [param01]t_Point top_p: 顶点坐标值
* [param02]t_Point botton_p : 地板坐标值
**************************************************************************************************/
void R61509V_DrawRectangle(u16 x1,u16 y1,u16 x2,u16 y2,u16 color)
{
	R61509V_DrawLine( x1, y1,	x1,	y2, color );
	R61509V_DrawLine( x1, y1,	x2,	y1, color );
	R61509V_DrawLine( x2, y1,	x2,	y2, color );
	R61509V_DrawLine( x1, y2,	x2,	y2, color );
}
/*******************************************************************************
*函数名			:	R61509V_DrawPoint_big
*功能描述		:	在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_Fill(
							u16 xsta,u16 ysta,
							u16 xend,u16 yend,
							u16 color
)
{          
	unsigned int i;
	unsigned int j;	
//	u16 x1=0,y1=0,x2=0,y2=0;

//	switch(Sreen_Rotate)
//	{
//		case 	SCREEN_ROTATE_0D:		
//					{
//						xend=xend-1;
//						yend=yend-1;
//					}
//			break;
//		case 	SCREEN_ROTATE_90D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;	
//						xsta=R61509V_H-y2;	xend=R61509V_H-y1-1;
//						ysta=x1;	yend=x2-1;
//					}
//			break;
//		case 	SCREEN_ROTATE_180D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;
//						xsta=R61509V_H-x2;	xend=R61509V_H-x1-1;
//						ysta=R61509V_W-y2;	yend=R61509V_W-y1-1;
//					}
//			break;
//		case	SCREEN_ROTATE_270D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;
//						xsta=y1;	xend=y2-1;
//						ysta=R61509V_W-x2;	yend=R61509V_W-x1-1;
//					}
//			break;
//		default: break;			
//	}
	
//	switch(Sreen_Rotate)
//	{
//		case SCREEN_ROTATE_0D:{}
//			break;
//		case SCREEN_ROTATE_90D:{x1=R61509V_H-y;y=x;x=x1;}
//			break;
//		case SCREEN_ROTATE_180D:{x1=R61509V_H-x;y=R61509V_W-y;x=x1;}
//			break;
//		case	SCREEN_ROTATE_270D:{x1=y;y=R61509V_W-x;x=x1;}
//			break;
//		default: break;			
//	}

	R61509V_SetWindowAddress(xsta,ysta,xend,yend);
	R61509V_CS_LOW; 					//片选打开
	R61509V_RS_HIGH; 					//数据
	for(i=0;i<xend-xsta;i++)
	{
		for(j=0;j<yend-ysta;j++)
		{
			R61509V_WR_LOW;
			R61509V_DATABUS_PORT->ODR = color;
			R61509V_WR_HIGH;
		}
	}
	R61509V_CS_HIGH;	
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void R61509V_ShowChar(
										u16 x,			//x				:起点x坐标
										u16 y,			//y				:起点y坐标
										u8 font,		//font		:字体大小
										u8 num,			//num			:字节数
										u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	u8 temp;
	u8 i=0,j=0;
	unsigned short x1=0,x2=0,y1=0,y2=0;
	u16 colortemp=R61509V_POINT_COLOR;
//	CoordinateTransform(&x1,&y1,&x2,&y2);
	x1	=	x;
	y1	=	y;
	
	if(font==12)
	{
		if(x>R61509V_V-12||y>R61509V_H-12)
			return;
		
		x2	=	x+12-1;
		y2	=	y+12;
//		R61509V_SetWindowAddress(x,y,x+12-1,y+12);      //设置光标位置 
	}
	if(font==16)
	{
		if(x>R61509V_V-16||y>R61509V_H-16)
			return;
		x2	=	x+16-1;
		y2	=	y+16;
//		R61509V_SetWindowAddress(x,y,x+16-1,y+16);      //设置光标位置 
	}
	if(font==24)
	{
		if(x>R61509V_V-24||y>R61509V_H-24)
			return;
		x2	=	x+24-1;
		y2	=	y+24;
//		R61509V_SetWindowAddress(x,y,x+24-1,y+24);      //设置光标位置 
	}
	else if(font==32)
	{
		if(x>R61509V_V-32||y>R61509V_H-32)
			return;
		if(num==128)
		{
			x2	=	x+32-1;
			y2	=	y+32-1;
//			R61509V_SetWindowAddress(x,y,x+32-1,y+32);      //设置光标位置
		}
		else
		{
			x2	=	x+16-1;
			y2	=	y+32;
//			R61509V_SetWindowAddress(x,y,x+16-1,y+32);      //设置光标位置 
		}
	}
	else
	{
//		return ;
	}
//	CoordinateTransform(&x1,&y1,&x2,&y2);
	R61509V_SetWindowAddress(x1,y1,x2,y2);      //设置光标位置
	
	i=0;
	for(i=0;i<num;i++)
	{ 
		u16 R61509V_PEN_COLOR	=	R61509V_BLUE;   	//画笔色	
		temp=Buffer[i];		 					//调用1608字体--二维数组形式--字库使用时取消 	
		for(j=0;j<8;j++)
		{
			if((temp&0x80)==0X80)
			{
				R61509V_PEN_COLOR=R61509V_POINT_COLOR;
			}
			else
				R61509V_PEN_COLOR=R61509V_BACK_COLOR;
			
