wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 201805102.c
			R61509V_WriteData16(R61509V_PEN_COLOR);
			temp=temp<<1;
		}
		R61509V_POINT_COLOR=colortemp;	
	}	
}

/*******************************************************************************
*函数名		:	R61509V_ShowChar
*功能描述	:	在指定位置显示一个字符
*输入			: x,y		:起点坐标
						num		:要显示的字符:" "--->"~"
						mode	:叠加方式(1)还是非叠加方式(0)
						num		:要显示的字符:" "--->"~"
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void R61509V_ShowCharT(u16 x,u16 y,u8 num,u8 mode)
{
//	R61509V_BACK_COLOR	//背景色
//	R61509V_POINT_COLOR	//画笔色
	u8 temp;
	u8 pos,t;
	u16 x0=x;
	u16 colortemp=R61509V_POINT_COLOR; 
	if(x>R61509V_V-16||y>R61509V_H-16)
		return;	    
	//设置窗口		   
	num=num-' ';//得到偏移后的值
//	num=41;//得到偏移后的值
	
	
//	R61509V_SetWindowAddress(x,y,x+8-1,y+16-1);      //设置光标位置 
	if(!mode) //非叠加方式
	{
		for(pos=0;pos<16;pos++)
		{ 
			temp=code_asc2_1608[(u16)num*16+pos];		 		//调用1608字体
//			temp=code_num_1608[(u16)num*16+pos];		 //调用1608字体
			for(t=0;t<8;t++)
			{                 
				if((temp&0x01)==0x01)
					R61509V_POINT_COLOR=colortemp;
				else
					R61509V_POINT_COLOR=R61509V_BACK_COLOR;

				R61509V_DrawDot(x,y,R61509V_POINT_COLOR);//画一个点 
				
				temp=temp>>1; 
				x++;
			}
			x=x0;
			y++;
		}	
	}
	else//叠加方式
	{
		for(pos=0;pos<16;pos++)
		{
			temp=code_asc2_1608[(u16)num*16+pos];		 //调用1608字体
			for(t=0;t<8;t++)
			{                 
				if(temp&0x01)
					R61509V_DrawDot(x+t,y+pos,R61509V_POINT_COLOR);//画一个点     
				temp>>=1; 
			}
		}
	}
	R61509V_POINT_COLOR=colortemp;	    	   	 	  
}










/**************************************************************************************************
* [Function] R61509V_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void R61509V_DrawPixelEx( u16 x, u16 y, u16 color )
{
	R61509V_DrawDot(x,y,color);		//画点
}




















/**************************************************************************************************
* [Function] R61509V_Setbackground:  设置背景颜色
* [param01]u16 BackColor: 背景颜色值
**************************************************************************************************/
void R61509V_Setbackground( u32 TotalPix, u16 BackColor )
{
	u32 i;

	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;

	for ( i = 0; i < TotalPix; i++ )
	{
		R61509V_DATABUS_PORT->ODR = BackColor;
		R61509V_WR_LOW;
		R61509V_WR_HIGH;
	}
	R61509V_CS_HIGH;
}


/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/







 
/*******************************************************************************
*函数名			:	R61509V_Clean
*功能描述		:	显示汉字程序
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_CHINESE(unsigned char zimo[720],unsigned int backcolor)  //写入字符
{
	unsigned char j,flag=0;
	unsigned char *point;
	unsigned int i,x1=0x00,x2=0x17,y1=0x00,y2=0x17;
	unsigned int colors[10]=
	{
		0xf800,0x07e0,0x001f,0xffe0,0x0000,0x07ff,0xf81f,0xb81f,0x7f7,0xfec0
	};
	point=&zimo[0];
	for(i=1;i<=720;i++,point++)
	{  
		for(j=0;j<=7;j++)
		{
			if((*point<<j)&0x80)
			{
				R61509V_WriteData16(colors[flag]);
				R61509V_Delay(1);
			}
			else
			{
				R61509V_WriteData16(backcolor);
				R61509V_Delay(1);
			}
		}   
		if(i%72==0)
		{
			x1=x1+24;x2=x2+24;y1=y1+24;y2=y2+24;
			flag=flag+1;
			R61509V_SetWindowAddress(x1,y1,x2,y2);
		}   
	}
}

/*******************************************************************************
*函数名			:	R61509V_DrawPoint_big
*功能描述		:	画一个大点
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_DrawDot_big(u16 x,u16 y,u16 color)
{
//	if((x<=5)&&(y<=5))
//	{
//		R61509V_Fill(0,0,x+10,y+10,color);
//	}
//	else if((x>5)&&(y<=5))
//	{
//		R61509V_Fill(x-5,0,x+5,y+10,color);
//	}
//	else if((x<=5)&&(y>5))
//	{
//		R61509V_Fill(0,y-5,x+10,y+5,color);
//	}
//	else if((x>5)&&(y>5))
//	{
//		R61509V_Fill(x-5,y-5,x+5,y+5,color);
//	}
	
	if((x==0)&&(y==0))
	{
		R61509V_Fill(0,0,x+2,y+2,color);
	}
	else if((x>0)&&(y>0))
	{
		R61509V_Fill(x-1,y-1,x+1,y+1,color);
	}
	
//	R61509V_Fill(x-1,y-1,x+1,y+1,color);
}





//#endif//R61509V_61509_EN
/************************************** The End Of FILE **************************************/


